--
-- PostgreSQL database dump
--

\restrict 6p6pU958sH6j8Whf1hV2MaxBUZ3361UqaHtMEPKRAbKE6sTz45I18E5UJYV1cAv

-- Dumped from database version 16.13 (Ubuntu 16.13-0ubuntu0.24.04.1)
-- Dumped by pg_dump version 16.13 (Ubuntu 16.13-0ubuntu0.24.04.1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- Name: leave_record; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.leave_record (
    id integer NOT NULL,
    user_id integer,
    leave_type character varying(50) NOT NULL,
    start_date date NOT NULL,
    end_date date NOT NULL,
    half_day boolean DEFAULT false,
    reason character varying(255),
    receipt_url character varying(500),
    days double precision NOT NULL,
    status character varying(20) DEFAULT 'pending'::character varying,
    created_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP,
    updated_at timestamp without time zone DEFAULT CURRENT_TIMESTAMP
);


ALTER TABLE public.leave_record OWNER TO postgres;

--
-- Name: leave_record_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.leave_record_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.leave_record_id_seq OWNER TO postgres;

--
-- Name: leave_record_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.leave_record_id_seq OWNED BY public.leave_record.id;


--
-- Name: user; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public."user" (
    id integer NOT NULL,
    username character varying(150) NOT NULL,
    password character varying(150) NOT NULL,
    is_admin boolean DEFAULT false,
    vacation_days double precision DEFAULT 0.0,
    sick_days double precision DEFAULT 0.0,
    personal_days double precision DEFAULT 0.0,
    menstrual_days double precision DEFAULT 0.0,
    family_care_days double precision DEFAULT 0.0,
    compassionate_days double precision DEFAULT 0.0
);


ALTER TABLE public."user" OWNER TO postgres;

--
-- Name: user_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.user_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.user_id_seq OWNER TO postgres;

--
-- Name: user_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.user_id_seq OWNED BY public."user".id;


--
-- Name: leave_record id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.leave_record ALTER COLUMN id SET DEFAULT nextval('public.leave_record_id_seq'::regclass);


--
-- Name: user id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."user" ALTER COLUMN id SET DEFAULT nextval('public.user_id_seq'::regclass);


--
-- Data for Name: leave_record; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.leave_record (id, user_id, leave_type, start_date, end_date, half_day, reason, receipt_url, days, status, created_at, updated_at) FROM stdin;
1	2	病假	2025-02-19	2025-02-19	t	半天 - 測試	https://drive.google.com/uc?export=view&id=1qlC785SPN-5kCSR1VEdPE87R5Sn0CwZP	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
2	2	特休	2025-02-20	2025-02-21	f	Uuu	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
3	7	病假	2025-01-02	2025-01-02	t	半天 - 生病	https://drive.google.com/uc?export=view&id=1pTAX3RVpIVr9L0r3EA2xDEkdHMnG7qdR	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
4	7	病假	2025-02-06	2025-02-06	t	半天 - 生病	https://drive.google.com/uc?export=view&id=1MbmcjtA3ieBZ-jHV4EPD6GH_fQQho6ZH	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
5	7	特休	2025-02-10	2025-02-10	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
6	7	病假	2025-02-11	2025-02-11	f	生病	https://drive.google.com/uc?export=view&id=1V4mkZsldIT9kqGlGmETidJiXwAYs8mxe	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
7	9	病假	2025-01-02	2025-01-02	t	半天 - 生病	https://drive.google.com/uc?export=view&id=1Nlu4Q6gS2o9Ol6WtO5dPbZ8LRyvNjoX3	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
8	9	病假	2025-02-06	2025-02-06	t	半天 - 生病	https://drive.google.com/uc?export=view&id=18TQggH-glsqXFHWhXmcJVUSPDmMuWFc0	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
9	8	特休	2025-02-08	2025-02-08	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
10	6	病假	2025-01-03	2025-01-03	f	病假	https://drive.google.com/uc?export=view&id=1MBa0IVhd0rpWCwJY0Xop1zKI3PDK8RLN	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
11	6	生理假	2025-01-13	2025-01-13	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
12	6	特休	2025-02-08	2025-02-08	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
13	5	家庭照顧假	2025-01-22	2025-01-22	f	家庭照顧	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
14	5	特休	2025-02-08	2025-02-08	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
15	4	特休	2025-01-24	2025-01-24	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
16	4	特休	2025-02-03	2025-02-03	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
17	4	特休	2025-02-08	2025-02-08	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
18	3	特休	2025-02-08	2025-02-08	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
19	3	家庭照顧假	2025-02-10	2025-02-10	f	家庭照顧	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
20	5	家庭照顧假	2025-02-12	2025-02-12	f	陪父親回診骨科。	https://drive.google.com/uc?export=view&id=1gTqgpKfX5-fjoWv9KFB8dQc5Y7ynUUXU	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
21	6	家庭照顧假	2025-02-24	2025-02-24	f	陪家人	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
22	2	特休	2025-02-19	2025-02-19	f	yes	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
23	10	特休	2025-03-06	2025-03-06	f	結婚登記	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
24	8	特休	2025-03-03	2025-03-03	f	家裡有事情	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
25	7	特休	2025-03-17	2025-03-18	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
26	5	家庭照顧假	2025-02-26	2025-02-26	f	陪父親去醫院回診	https://drive.google.com/uc?export=view&id=1aULo99dW9AszxZT0GRb1XGOOxkUC2qbu	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
27	6	病假	2025-02-14	2025-02-14	f	發燒	https://drive.google.com/uc?export=view&id=1oYIm13_U3zeizDKOAF294oSNfviXT2OW	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
28	9	家庭照顧假	2025-02-21	2025-02-21	f	顧小孩	https://drive.google.com/uc?export=view&id=1Bt3hSWzQlzaBzGzdQSBGwxXSLoqvd0Oq	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
29	9	家庭照顧假	2025-02-25	2025-02-25	f	顧小孩	https://drive.google.com/uc?export=view&id=1HO4xHQ3gvC6IJPnR4r9rL2-xNNls9HAB	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
30	9	特休	2025-03-17	2025-03-18	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
31	2	特休	2025-03-10	2025-03-14	f	123	\N	5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
32	2	事假	2025-03-07	2025-03-07	f	12	https://drive.google.com/uc?export=view&id=1fOPAECJ5IbP18UZ_UJUzRtC1_xqSMgF6	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
33	10	事假	2025-04-21	2025-04-23	f	(婚假)蜜月旅行	https://drive.google.com/uc?export=view&id=1KpfnyOZ7gQywSY4LFK2LieuOqF1WhhOl	3	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
34	10	事假	2025-04-14	2025-04-18	f	(婚假)蜜月旅行	https://drive.google.com/uc?export=view&id=1nm6z2tS3G7OMRt0Aii7EgOkhnl6D6lup	5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
35	7	家庭照顧假	2025-02-19	2025-02-19	t	半天 - 小孩住院	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
36	7	家庭照顧假	2025-02-24	2025-02-24	f	小孩住院	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
37	9	家庭照顧假	2025-02-19	2025-02-19	t	半天 - 小孩生病	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
38	9	病假	2025-03-07	2025-03-07	f	感冒	https://drive.google.com/uc?export=view&id=1uKQyr75mh0rwMb8GZBn3B_4Wj6sfxEhi	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
39	6	生理假	2025-03-11	2025-03-11	f	生理期	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
40	3	特休	2025-03-20	2025-03-20	f	親友聚餐	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
41	3	病假	2025-03-12	2025-03-12	f	病假	https://drive.google.com/uc?export=view&id=1havITBWrQV5KLmOUYT3bM_v-9prfj9I9	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
42	4	特休	2025-03-14	2025-03-14	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
43	8	生理假	2025-03-10	2025-03-10	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
44	5	家庭照顧假	2025-03-14	2025-03-14	f	太太生理期血量爆多，在家照顧	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
45	2	生理假	2025-03-18	2025-03-18	t	半天 - test for 01	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
46	10	生理假	2025-03-17	2025-03-17	t	半天 - 生理痛	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
47	3	家庭照顧假	2025-03-19	2025-03-19	t	半天 - 小孩生病	https://drive.google.com/uc?export=view&id=1vG-b3AYj1ajSX7i2jZHVC77076SbjXRT	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
48	6	特休	2025-03-20	2025-03-20	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
49	9	病假	2025-03-11	2025-03-11	t	半天 - 感冒	https://drive.google.com/uc?export=view&id=1zVMEk9Wo_K51nIc_VkHiExSNAmj7W1bA	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
50	3	病假	2025-03-24	2025-03-24	f	感冒	https://drive.google.com/uc?export=view&id=1rdC8FTrUrzAlxO7kyFIf7ip515AOmTRu	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
51	7	病假	2025-03-24	2025-03-24	f	感冒	https://drive.google.com/uc?export=view&id=1O6GdM5Y2bvgnMh_YbOaVzRSxo2ZSBafb	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
52	6	事假	2025-03-28	2025-03-28	t	半天 - 牙套調整	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
53	5	家庭照顧假	2025-03-26	2025-03-26	f	爸爸癌症回診	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
54	5	特休	2025-03-31	2025-03-31	f	休息	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
55	8	特休	2025-04-08	2025-04-08	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
56	4	特休	2025-04-11	2025-04-11	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
57	6	家庭照顧假	2025-04-08	2025-04-08	t	半天 - 補請	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
58	10	特休	2025-04-11	2025-04-11	t	半天 - 在家休息	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
59	3	特休	2025-04-28	2025-04-28	f	朋友聚餐	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
60	6	生理假	2025-04-16	2025-04-16	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
61	5	特休	2025-04-16	2025-04-16	t	半天 - 家裡有急事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
62	5	特休	2025-04-18	2025-04-18	f	要出外辦事情	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
63	4	特休	2025-04-25	2025-04-25	f	特休。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
64	6	特休	2025-04-25	2025-04-25	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
65	5	家庭照顧假	2025-05-07	2025-05-07	f	陪父親癌症回診	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
66	3	家庭照顧假	2025-05-05	2025-05-07	f	小孩流感	https://drive.google.com/uc?export=view&id=1fgPdEQD0kFmkfIXMr2peuKIa2apWcmSO	3	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
67	10	病假	2025-05-14	2025-05-14	f	反覆發燒看醫生	https://drive.google.com/uc?export=view&id=1tYjMdkJAXZiSzk5-MOmbUi6GJPzulnQa	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
68	9	病假	2025-05-07	2025-05-07	f	眼睛檢查	https://drive.google.com/uc?export=view&id=1g6Z9yf_OwPsRx1eckv9cUMYa6giVNqA6	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
69	9	特休	2025-05-16	2025-05-16	f	旅遊	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
70	10	病假	2025-05-15	2025-05-15	f	反覆發燒39度多	https://drive.google.com/uc?export=view&id=1qcymCjNrZc1txkRbIDvcbL8pRdnNKhEm	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
71	5	特休	2025-05-19	2025-05-19	f	家庭聚餐	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
72	6	生理假	2025-05-16	2025-05-16	f	生理不適	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
73	10	病假	2025-05-16	2025-05-16	t	半天 - 重感冒看醫生	https://drive.google.com/uc?export=view&id=1QgFf1BGeoUkq2G9OmjK4FwOU7Zg3EPdd	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
74	10	病假	2025-05-19	2025-05-19	f	發燒不適	https://drive.google.com/uc?export=view&id=1kpM3GpzGGw0kkF0KdQWszM1sAkmGeKjl	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
75	6	特休	2025-05-21	2025-05-21	t	半天 - 特休	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
76	10	病假	2025-05-21	2025-05-21	t	半天 - 重感冒頭痛不適	https://drive.google.com/uc?export=view&id=1qYRZGeZkGEbqh7vXzYt-lW9sDZ-ttzNV	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
77	7	病假	2025-05-16	2025-05-16	f	看醫生	https://drive.google.com/uc?export=view&id=141aYwex2IQrsSUPHJz7N6xQ44cFoqGnq	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
78	6	特休	2025-05-23	2025-05-23	t	半天 - 待退燒	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
79	4	特休	2025-05-29	2025-05-29	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
80	3	病假	2025-05-27	2025-05-27	f	生病	https://drive.google.com/uc?export=view&id=1mns82ZV53iNtnae-S1eH8Qph17GFAvss	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
81	6	病假	2025-06-02	2025-06-02	f	病假	https://drive.google.com/uc?export=view&id=167fd_rwTY6o2nSxPn3F4Y5dSdA4HNl5J	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
82	9	家庭照顧假	2025-06-10	2025-06-10	t	半天 - 帶小孩看醫生	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
83	8	病假	2025-06-02	2025-06-03	f	看醫生	https://drive.google.com/uc?export=view&id=1ji0S-e4Vtu-SpAhQlQa50w405rkdt6ic	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
84	10	生理假	2025-06-11	2025-06-11	t	半天 - 經痛不適	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
85	10	家庭照顧假	2025-06-12	2025-06-12	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
86	4	特休	2025-06-13	2025-06-13	f	週五特休  週六週日至無極三清總道院做點燈/普渡簡報。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
87	6	生理假	2025-06-12	2025-06-12	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
88	9	病假	2025-06-17	2025-06-17	f	感冒發燒	https://drive.google.com/uc?export=view&id=1cz6x7EPrV0piVMHwP-IWRLPn4CDySrcQ	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
89	3	特休	2025-06-25	2025-06-27	f	旅遊	\N	3	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
90	5	特休	2025-06-23	2025-06-23	f	Day Off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
91	6	家庭照顧假	2025-06-19	2025-06-20	f	親屬住院照護	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
92	10	特休	2025-06-27	2025-06-27	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
93	4	特休	2025-06-27	2025-06-27	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
94	7	病假	2025-06-25	2025-06-25	f	感冒	https://drive.google.com/uc?export=view&id=1Sg1w66-7dHzBQ4FuloOs8JimePoNs65l	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
95	7	家庭照顧假	2025-06-30	2025-07-01	f	照顧小孩	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
96	9	家庭照顧假	2025-06-30	2025-07-01	f	顧小孩	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
97	3	病假	2025-06-30	2025-06-30	f	看病	https://drive.google.com/uc?export=view&id=1VDoXggv2DjZKepHvWrUepiZDMUBua2eb	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
98	6	特休	2025-07-02	2025-07-02	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
99	9	病假	2025-07-02	2025-07-02	f	感冒	https://drive.google.com/uc?export=view&id=1Er55M-3n1XRsxT4SPKCXQqF2XxtdhpD1	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
100	10	特休	2025-07-09	2025-07-09	f	丹娜絲颱風過後西南氣流雨量龐大，在家防災	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
101	6	事假	2025-07-09	2025-07-09	f	臨時事假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
102	5	家庭照顧假	2025-07-09	2025-07-09	f	陪父親癌症回診化療	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
103	3	家庭照顧假	2025-07-09	2025-07-09	f	小孩看病	https://drive.google.com/uc?export=view&id=1VhNYoUyW32DEHsw6ERfj039GjA0s_48Z	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
104	4	家庭照顧假	2025-07-11	2025-07-11	f	陪病住院	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
105	7	家庭照顧假	2025-07-11	2025-07-11	f	照顧小孩	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
106	6	家庭照顧假	2025-07-15	2025-07-15	t	半天 - 中信銀行處理	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
107	7	病假	2025-07-10	2025-07-10	f	感冒	https://drive.google.com/uc?export=view&id=1kUlz9ySA6HWztQBG9h06wHNgzCskFNZR	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
108	5	特休	2025-07-18	2025-07-18	f	Day Off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
109	4	特休	2025-07-18	2025-07-18	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
110	6	病假	2025-07-18	2025-07-18	f	高燒	https://drive.google.com/uc?export=view&id=1Mn92dcm_DxFx_0Piw6wmbxjbPGvF3bB0	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
111	10	特休	2025-07-25	2025-07-25	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
112	8	病假	2025-07-14	2025-07-14	f	看醫生	https://drive.google.com/uc?export=view&id=1PYSQSNDEMI31Q5rm6lDFPMRpYnvioSh0	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
113	8	特休	2025-08-01	2025-08-01	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
114	6	特休	2025-07-23	2025-07-23	t	半天 - 特休	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
115	6	特休	2025-07-28	2025-07-28	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
116	10	生理假	2025-07-28	2025-07-28	t	半天 - 生理期不適	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
117	10	家庭照顧假	2025-07-29	2025-07-29	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
118	3	病假	2025-07-25	2025-07-25	f	看病	https://drive.google.com/uc?export=view&id=1OqZWUNgROuhkzsA5AbE1r8YawNMQyoSR	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
119	6	事假	2025-07-30	2025-07-30	t	半天 - 事假	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
120	10	病假	2025-07-31	2025-07-31	f	發燒、嘔吐、腹瀉，在家休息	https://drive.google.com/uc?export=view&id=1qKjbIbIjSCwrXCXm-K3sFB8rVL62injh	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
121	10	病假	2025-08-01	2025-08-01	f	身體不適，藥物嗜睡影響開車	https://drive.google.com/uc?export=view&id=1gOVIzqu83fuL8SRGk7fTILlQqqwjjar3	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
122	9	家庭照顧假	2025-08-04	2025-08-05	f	顧小孩	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
123	9	特休	2025-08-06	2025-08-08	f	顧小孩	\N	3	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
124	6	事假	2025-08-04	2025-08-04	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
125	5	特休	2025-07-30	2025-07-30	f	陪父親回診	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
126	3	特休	2025-08-14	2025-08-15	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
127	3	特休	2025-08-18	2025-08-19	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
128	4	家庭照顧假	2025-08-08	2025-08-08	f	帶母親陪病住院。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
129	6	事假	2025-08-07	2025-08-07	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
130	6	事假	2025-08-11	2025-08-11	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
131	10	家庭照顧假	2025-08-18	2025-08-18	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
132	3	家庭照顧假	2025-08-12	2025-08-12	f	小孩發燒	https://drive.google.com/uc?export=view&id=1yOe-QeNypkf_nPYdTEZ8iN5Vii9ZcylZ	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
133	3	病假	2025-08-11	2025-08-11	f	看醫生	https://drive.google.com/uc?export=view&id=1dIrHn5lLfQWbGMN8Ehooqc1gVdS0CIQb	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
134	6	家庭照顧假	2025-08-13	2025-08-13	t	半天 - 生理半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
135	6	特休	2025-08-15	2025-08-15	f	特休一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
136	5	同情假	2025-08-14	2025-08-14	f	父親離世	https://drive.google.com/uc?export=view&id=1kWNYsBRICCxAQc_K1oF_-Qb0IUEpF6ni	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
137	5	同情假	2025-08-19	2025-08-19	f	父親離世	https://drive.google.com/uc?export=view&id=1jTxj20X6SRAXOTQupL8uTpKUN-Ul28Fc	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
138	5	同情假	2025-08-25	2025-08-25	f	父親離世	https://drive.google.com/uc?export=view&id=1aGxYS2AVnNRn2R6Fh61gor--X8Z8JMdq	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
139	5	同情假	2025-08-27	2025-08-27	f	父親離世	https://drive.google.com/uc?export=view&id=1qQYgsMCH0W-ktSgoso-bL-kvoRQNyZVM	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
140	5	同情假	2025-09-01	2025-09-01	f	父親離世	https://drive.google.com/uc?export=view&id=1JSOee9fjcD0I7pHejUWunFl49Zts7-Nn	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
141	5	同情假	2025-08-26	2025-08-26	f	父親離世	https://drive.google.com/uc?export=view&id=1Lea4O-ggsRzhUfjSqUPzZ1IKIK5vqAbc	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
142	10	特休	2025-08-26	2025-08-26	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
143	8	特休	2025-08-20	2025-08-20	f	家裡有事要辦	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
144	6	病假	2025-08-20	2025-08-20	f	發燒+喉痛\r\n註:和興門診醫師出國，至合作藥局領藥~	https://drive.google.com/uc?export=view&id=1lD4ETG8q7eZRVQ2xH9wKqIzN-FCEdfTH	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
146	2	特休	2025-08-31	2025-09-01	f	測試	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
147	4	家庭照顧假	2025-08-22	2025-08-22	f	陪病住院	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
148	3	特休	2025-08-26	2025-08-26	f	朋友聚餐	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
149	6	特休	2025-08-26	2025-08-26	t	半天 - 特休	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
150	6	家庭照顧假	2025-08-28	2025-08-28	f	家庭照顧假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
151	7	病假	2025-08-27	2025-08-27	f	看牙醫	https://drive.google.com/uc?export=view&id=1bHO70lpywPaPnJJAlmOcE-XVWAt6Y-wF	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
152	9	病假	2025-08-27	2025-08-27	f	看牙齒	https://drive.google.com/uc?export=view&id=1gL8nqdnwxGfGc6ZsYHxZ7Ahoa5BtVpuK	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
153	10	特休	2025-09-01	2025-09-01	t	半天 - 在家休息	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
154	6	事假	2025-09-02	2025-09-02	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
155	4	家庭照顧假	2025-09-05	2025-09-05	f	陪病住院	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
156	6	家庭照顧假	2025-09-04	2025-09-04	t	半天 - 家庭照顧半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
157	6	特休	2025-09-08	2025-09-08	f	特休一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
158	8	特休	2025-09-15	2025-09-15	f	旅遊	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
159	7	家庭照顧假	2025-09-08	2025-09-08	f	小孩生病	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
160	6	事假	2025-09-10	2025-09-10	t	半天 - 事假	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
161	4	家庭照顧假	2025-09-12	2025-09-12	f	陪病住院	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
162	7	家庭照顧假	2025-09-11	2025-09-11	f	小孩生病	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
163	10	生理假	2025-09-16	2025-09-16	t	半天 - 生理痛	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
164	6	家庭照顧假	2025-09-17	2025-09-17	t	半天 - 半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
165	10	病假	2025-09-18	2025-09-18	f	低燒不退，身體不適	https://drive.google.com/uc?export=view&id=1XHdZUsGTI8SmL55YbfnXkL0nd2bTlC0R	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
166	10	同情假	2025-09-19	2025-09-19	f	持續低燒不退，上吐下瀉，身體不適	https://drive.google.com/uc?export=view&id=1ImbX2quGq5raFsBg8-2f7SEXWq8WRGKj	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
167	5	病假	2025-09-15	2025-09-15	f	回醫院回診	https://drive.google.com/uc?export=view&id=1GI7bOnOZVqQPmdEGvwNBKsKkM3qxljuU	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
168	3	病假	2025-09-22	2025-09-22	f	看醫生	https://drive.google.com/uc?export=view&id=1PoJdIk_oaI5HqtQL6-OWZjBRElC7DjEq	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
169	10	家庭照顧假	2025-09-24	2025-09-24	t	半天 - 孕期異狀，回診檢查	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
170	6	病假	2025-09-24	2025-09-24	f	腸胃炎	https://drive.google.com/uc?export=view&id=1oIHqawfSj6wT8xx45c25KchK5mpnpjuN	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
171	4	特休	2025-09-26	2025-09-26	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
172	9	特休	2025-09-30	2025-10-03	f	旅遊	\N	4	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
173	7	病假	2025-09-26	2025-09-26	f	感冒	https://drive.google.com/uc?export=view&id=1tC9YbOz5G3dGKtU_N9L-MmiD85ApL00h	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
174	7	特休	2025-09-30	2025-10-03	f	旅遊	\N	4	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
175	6	事假	2025-09-30	2025-09-30	f	事假補申請	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
176	10	特休	2025-10-09	2025-10-09	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
177	10	家庭照顧假	2025-10-09	2025-10-09	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
178	10	特休	2025-10-20	2025-10-20	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
179	4	特休	2025-10-17	2025-10-17	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
180	3	病假	2025-10-16	2025-10-16	f	看病	https://drive.google.com/uc?export=view&id=1I3gA5YECpx20gHoFW-Ski6kWxNqv9bLI	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
181	3	特休	2025-10-27	2025-10-27	f	朋友聚會	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
182	6	事假	2025-10-21	2025-10-21	f	回家領電腦+組裝	https://drive.google.com/uc?export=view&id=1Vy-U6kx3VN-ib5azFuBxXuImFpKF-J2E	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
183	6	病假	2025-10-28	2025-10-28	f	急性上呼吸道感染、腸功能性疾患	https://drive.google.com/uc?export=view&id=1q8A-SQOPc11PTB7hl5-_3zAilyr4_ngE	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
184	6	病假	2025-10-29	2025-10-29	f	同昨日腸胃型感冒，第二日（仍有嘔吐+腹瀉）	https://drive.google.com/uc?export=view&id=1HXdnViv3JXG-aKJWfd_obKitvvFpZT4V	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
185	4	特休	2025-10-31	2025-10-31	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
186	9	病假	2025-10-31	2025-10-31	f	流感	https://drive.google.com/uc?export=view&id=1qEOC6URF7ToEMnk4cwdLsCpwYU0G6TIK	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
187	4	家庭照顧假	2025-11-07	2025-11-07	f	陪病住院(媽媽)。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
188	6	事假	2025-11-04	2025-11-04	t	半天 - 事假(上午)\r\n郵局處理帳戶	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
189	5	同情假	2025-11-13	2025-11-13	f	處理父親離世後的事情	https://drive.google.com/uc?export=view&id=1hKEz3fIA3ZQUThAife_HzWmb94RDmW-g	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
190	5	同情假	2025-11-20	2025-11-20	f	父親百日	https://drive.google.com/uc?export=view&id=1qNXbynHTI0WAMruVIk4UiAgEA8b9BlCA	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
191	5	特休	2025-11-21	2025-11-21	f	Day Off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
192	3	病假	2025-11-14	2025-11-14	f	就醫	https://drive.google.com/uc?export=view&id=1acimFuEhBZGhp-wxYFEScamyZ0Y0NFiC	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
193	3	病假	2025-11-17	2025-11-17	f	看病	https://drive.google.com/uc?export=view&id=13bU0j6leWcsP-0tUloyJTl3WTA6DjlrI	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
194	6	事假	2025-11-13	2025-11-13	f	事假補請	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
195	6	特休	2025-11-17	2025-11-17	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
196	9	病假	2025-11-17	2025-11-17	f	過敏	https://drive.google.com/uc?export=view&id=1_f37tI-XAcWgQer8BCcYrzHkLMrQSH32	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
197	7	病假	2025-11-17	2025-11-17	f	感冒	https://drive.google.com/uc?export=view&id=1_iUrzTNI2ZupDD3dDFrWI7wDW_m1aJdz	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
198	4	特休	2025-11-21	2025-11-21	f	特休。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
199	3	特休	2025-11-21	2025-11-21	f	看醫生	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
200	7	病假	2025-11-24	2025-11-24	f	看醫生	https://drive.google.com/uc?export=view&id=1gpR04MDSC4m1AiL29Bd6MIUqLq62XXwG	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
201	10	病假	2025-12-04	2025-12-04	f	婦產科轉診切片檢查	https://drive.google.com/uc?export=view&id=1jUEkpy5CtQG9VXREBTvuJv-4woRlYuwo	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
202	4	特休	2025-11-28	2025-11-28	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
203	3	特休	2025-12-01	2025-12-01	f	看病	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
204	3	特休	2025-12-08	2025-12-08	f	小孩運動會補假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
205	6	病假	2025-12-02	2025-12-02	f	病假一日	https://drive.google.com/uc?export=view&id=1x8Tqcx6cR-xwT5T8MD1KTi4N7PVxV0-o	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
206	10	病假	2025-12-16	2025-12-16	f	子宮鏡檢查	https://drive.google.com/uc?export=view&id=1gsktBRLAWa48cN_o14NNCrRvCHWE9rSC	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
207	4	家庭照顧假	2025-12-05	2025-12-05	f	陪家人住院健檢	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
208	4	特休	2025-12-12	2025-12-12	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
209	6	家庭照顧假	2025-12-09	2025-12-09	t	半天 - 家庭照顧假-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
210	5	特休	2025-12-12	2025-12-12	t	半天 - day off	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
211	10	家庭照顧假	2026-01-02	2026-01-02	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
212	7	家庭照顧假	2025-12-15	2025-12-15	t	半天 - 小孩打疫苗	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
213	8	特休	2025-12-19	2025-12-19	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
214	5	特休	2025-12-26	2025-12-26	f	day off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
215	8	特休	2025-12-23	2025-12-24	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
216	8	特休	2025-12-26	2025-12-26	f	旅遊	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
217	5	病假	2025-12-08	2025-12-08	f	回醫院回診	https://drive.google.com/uc?export=view&id=19KZiO8YR5BIEghWsdcg30TLAMeTvXhnc	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
218	10	病假	2025-12-24	2025-12-24	f	內視鏡手術	https://drive.google.com/uc?export=view&id=1yV5SF1aVRx8qETH_eHUMtB0-eBoywhpz	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
219	6	病假	2025-12-12	2025-12-12	f	流感	https://drive.google.com/uc?export=view&id=1Fy0o5vhZIzoA33Dt0-HLidkVyZTJfZ5J	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
220	7	特休	2025-12-19	2025-12-19	f	朋友聚會	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
221	4	特休	2025-12-19	2025-12-19	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
222	10	家庭照顧假	2025-12-19	2025-12-19	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
223	4	特休	2025-12-26	2025-12-26	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
224	3	家庭照顧假	2025-12-02	2025-12-02	t	半天 - 小孩運動會	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
225	3	特休	2025-12-26	2025-12-26	f	年假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
226	7	特休	2025-12-26	2025-12-26	f	旅遊	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
227	7	特休	2025-12-29	2025-12-29	f	旅遊	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
228	6	事假	2025-12-18	2025-12-18	f	事假補請	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
229	6	病假	2025-12-26	2025-12-26	f	發燒\r\n註:和興門診醫師請假，一樣至合作藥局領藥	https://drive.google.com/uc?export=view&id=1DL743R_bWeS9IqgJKP4DNTBTfcuZyQC5	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
230	6	事假	2025-12-30	2025-12-30	f	回舊社一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
231	10	家庭照顧假	2026-01-07	2026-01-07	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
232	10	家庭照顧假	2026-01-15	2026-01-15	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
233	9	病假	2025-12-26	2025-12-26	t	半天 - 過敏	https://drive.google.com/uc?export=view&id=1Ed1WU90VTPxzR6UXVw1F68-qZ5frPFmg	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
234	9	病假	2025-12-29	2025-12-29	f	感冒	https://drive.google.com/uc?export=view&id=1sJ2Ewl8wnbqt4MaKxHYgcK58TgN7HkFo	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
235	4	特休	2026-01-02	2026-01-02	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
236	3	特休	2026-01-05	2026-01-05	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
237	10	特休	2026-01-30	2026-01-30	f	在家休息	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
238	4	特休	2026-01-09	2026-01-09	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
239	10	特休	2026-02-13	2026-02-13	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
240	6	家庭照顧假	2026-01-06	2026-01-06	f	陪阿嬤出門	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
241	6	病假	2026-01-08	2026-01-08	f	發燒	https://drive.google.com/uc?export=view&id=1c4Ok4s3L8vcFftPakYLYhHysyYi3cwnP	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
242	10	特休	2026-01-09	2026-01-09	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
243	10	家庭照顧假	2026-01-12	2026-01-12	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
244	8	病假	2026-01-12	2026-01-12	f	看牙醫	https://drive.google.com/uc?export=view&id=1qyGE9qGiAH6O0KP76LeZwZAXrEzQcgAO	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
245	5	特休	2026-01-19	2026-01-19	f	Day off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
246	6	病假	2026-01-09	2026-01-09	f	1/8-病假第2日	https://drive.google.com/uc?export=view&id=1Q3Z4ltkDGqY3XXDJ8Lso8YaTRh9eGPDL	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
247	6	事假	2026-01-13	2026-01-13	t	半天 - 事假-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
248	6	生理假	2026-01-16	2026-01-16	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
249	10	家庭照顧假	2026-01-19	2026-01-19	t	半天 - 私事待辦	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
250	8	特休	2026-02-05	2026-02-06	f	旅遊	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
251	8	特休	2026-02-09	2026-02-13	f	旅遊	\N	5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
252	4	特休	2026-01-29	2026-01-30	f	特休	\N	2	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
253	8	病假	2026-01-30	2026-01-30	f	看醫生	https://drive.google.com/uc?export=view&id=1M0LULgO86oO_GzpAJVkagTDpXq8U_rUC	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
254	10	生理假	2026-02-03	2026-02-03	t	半天 - 生理期	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
255	6	事假	2026-01-28	2026-01-28	t	半天 - 事假-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
256	6	特休	2026-02-02	2026-02-02	f	特休一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
257	10	病假	2026-02-03	2026-02-03	t	半天 - 看醫生	https://drive.google.com/uc?export=view&id=1gxV96_Z-RxwOQ5gdmN6e25Y_BcoV8Y2l	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
258	6	特休	2026-01-22	2026-01-22	f	補-特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
259	3	家庭照顧假	2026-02-05	2026-02-05	f	接送小孩出去籃球隊比賽	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
260	4	特休	2026-02-06	2026-02-06	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
261	5	特休	2026-02-23	2026-02-23	f	Day off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
262	10	家庭照顧假	2026-02-23	2026-02-23	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
263	3	特休	2026-02-25	2026-02-25	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
264	4	特休	2026-02-26	2026-02-26	f	特休	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
265	6	病假	2026-02-06	2026-02-06	f	感冒發燒	https://drive.google.com/uc?export=view&id=18dR4publJ9iWdk1t5D2Ix-jvtaNhJ480	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
266	6	事假	2026-02-12	2026-02-12	t	半天 - 事假(半日)	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
267	6	生理假	2026-02-25	2026-02-25	f	生理假	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
268	10	家庭照顧假	2026-03-02	2026-03-02	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
269	6	事假	2026-03-06	2026-03-06	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
270	10	家庭照顧假	2026-03-06	2026-03-06	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
271	3	病假	2026-03-04	2026-03-04	f	就診	https://drive.google.com/uc?export=view&id=18egJcVwHbfxCZoPIbW3RcPvgecByK5h-	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
272	5	病假	2026-03-02	2026-03-02	f	回醫院回診	https://drive.google.com/uc?export=view&id=1tZBlXnNHhgkU0TriqFqMNuMwKfUZiJmg	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
273	5	家庭照顧假	2026-03-05	2026-03-05	f	照顧太太	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
274	10	家庭照顧假	2026-03-09	2026-03-09	t	半天 - 家裡有事	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
275	3	家庭照顧假	2026-03-10	2026-03-10	f	帶小孩做檢查	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
276	9	病假	2026-03-02	2026-03-02	f	過敏	https://drive.google.com/uc?export=view&id=1sTxxvaSMSVV_gLC0mabBvnuGUBlB6jNW	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
277	6	病假	2026-03-10	2026-03-10	f	發燒	https://drive.google.com/uc?export=view&id=1VMVBB_QnI0EZZ6s0jAnRwo8UysLVZ6RF	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
278	7	病假	2026-03-10	2026-03-10	f	看醫生	https://drive.google.com/uc?export=view&id=1Bi98i6rT1HbvSZH6U8yDWnp4wVsG8R83	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
279	6	病假	2026-03-11	2026-03-11	f	3/10病假 - 第二日	https://drive.google.com/uc?export=view&id=1P3Wl-l1u5sWha-ug9jVegu6vntxFYtat	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
280	3	特休	2026-03-12	2026-03-12	t	半天 - 請早上半天	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
281	10	特休	2026-03-16	2026-03-16	f	休息	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
282	5	特休	2026-03-13	2026-03-13	f	day off	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
283	3	特休	2026-03-19	2026-03-19	t	半天 - 早上半天	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
284	10	家庭照顧假	2026-03-23	2026-03-23	f	家裡有急事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
285	3	家庭照顧假	2026-03-26	2026-03-26	f	帶小孩看牙醫	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
286	4	特休	2026-03-27	2026-03-27	f	特休AL	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
287	10	生理假	2026-03-31	2026-03-31	t	半天 - 生理痛	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
288	8	病假	2026-03-20	2026-03-20	f	看醫生	https://drive.google.com/uc?export=view&id=1FfIIT1Jgfw3z-LICKsb-rde5l1OUk_D5	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
289	10	生理假	2026-03-31	2026-03-31	t	半天 - 生理痛	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
290	6	特休	2026-03-16	2026-03-16	f	特休一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
291	6	生理假	2026-03-18	2026-03-18	t	半天 - 生理假-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
292	6	事假	2026-03-20	2026-03-20	t	半天 - 事假半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
293	6	事假	2026-03-23	2026-03-23	t	半天 - 事假-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
294	6	家庭照顧假	2026-03-27	2026-03-27	f	原3/27半日-改整天	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
295	6	特休	2026-03-31	2026-03-31	t	半天 - 特休-半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
296	5	特休	2026-04-02	2026-04-02	f	陪家人回診	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
297	9	病假	2026-03-31	2026-03-31	f	感冒	https://drive.google.com/uc?export=view&id=1J0ShpS83wh5j5koS9-beODh64wXNclCy	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
298	3	特休	2026-04-07	2026-04-07	f	年假一天	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
299	10	家庭照顧假	2026-04-10	2026-04-10	f	家裡有事	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
300	3	病假	2026-04-09	2026-04-09	f	看病	https://drive.google.com/uc?export=view&id=1d3bG8ohQL5U58EiZYlWzMUXyJGwxg-Yb	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
301	6	事假	2026-04-02	2026-04-02	f	事假一日	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
302	6	特休	2026-04-10	2026-04-10	t	半天 - 特休(半日)	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
303	3	病假	2026-04-13	2026-04-13	f	看醫生	https://drive.google.com/uc?export=view&id=1GtOmDK9YgyxNw1wovNEnWHyf7gDs5O9t	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
304	10	特休	2026-04-15	2026-04-15	t	半天 - 在家休息	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
305	6	家庭照顧假	2026-04-16	2026-04-16	t	半天 - 下午半日	\N	0.5	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
306	4	家庭照顧假	2026-04-17	2026-04-17	f	陪病住院( 母親 )。	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
307	2	特休	2026-04-17	2026-04-17	f	Test	\N	1	pending	2026-04-17 18:30:20.324926	2026-04-17 18:30:20.324926
308	1	vacation	2026-04-20	2026-04-22	f	Test		3	pending	2026-04-17 18:41:02.320384	2026-04-17 18:41:02.320389
309	1	sick	2026-04-25	2026-04-25	f	Headache		1	pending	2026-04-17 18:41:22.212705	2026-04-17 18:41:22.212709
310	2	家庭照顧假	2026-04-18	2026-04-18	t	半天 - 1w3	\N	0.5	pending	2026-04-17 19:22:18.701492	2026-04-17 19:22:18.701492
311	2	病假	2026-04-19	2026-04-20	f	Test	/static/uploads/1776356367482.jpg	2	pending	2026-04-18 00:33:23.060102	2026-04-18 00:33:23.060102
312	2	事假	2026-04-18	2026-04-18	f	Test004	https://drive.google.com/uc?export=view&id=184qFxJC45Q4CHPaTs_yhPVIJCoP9FVv6	1	pending	2026-04-18 00:45:22.102168	2026-04-18 00:45:22.102168
313	2	事假	2026-04-21	2026-04-22	f	413 Request Entity Too Large\r\nnginx/1.24.0 (Ubuntu)	\N	2	pending	2026-04-18 00:48:47.994861	2026-04-18 00:48:47.994861
314	2	病假	2026-04-28	2026-04-29	f	123	https://drive.google.com/uc?export=view&id=1Z0F0km3bO5BVzzAPJc0sAHZgYUM3-ePg	2	pending	2026-04-18 00:58:48.96814	2026-04-18 00:58:48.96814
315	2	病假	2026-04-22	2026-04-22	t	半天 - test	\N	0.5	pending	2026-04-18 00:59:38.101407	2026-04-18 00:59:38.101407
316	2	病假	2026-04-22	2026-04-22	t	半天 - test	\N	0.5	pending	2026-04-18 01:00:03.346643	2026-04-18 01:00:03.346643
319	2	病假	2026-04-22	2026-04-22	f	test David sick leave no half day field	\N	1	pending	2026-04-18 01:03:08.920719	2026-04-18 01:03:08.920719
320	2	病假	2026-04-22	2026-04-22	t	半天 - test David sick leave with half day on	\N	0.5	pending	2026-04-18 01:03:09.538101	2026-04-18 01:03:09.538101
330	2	事假	2026-04-25	2026-04-25	f	Test1 no half_day key	\N	1	pending	2026-04-18 01:08:52.55482	2026-04-18 01:08:52.55482
331	2	事假	2026-04-26	2026-04-26	t	半天 - Test2 with half_day on	\N	0.5	pending	2026-04-18 01:08:54.186393	2026-04-18 01:08:54.186393
332	2	事假	2026-04-27	2026-04-27	f	Test3 half_day empty string	\N	1	pending	2026-04-18 01:08:54.886088	2026-04-18 01:08:54.886088
333	2	病假	2026-05-01	2026-05-01	f	test	https://drive.google.com/uc?export=view&id=1ezoGecyE0YqNl8u2jIQf6QJwqpkw_uqa	1	pending	2026-04-18 01:13:56.66508	2026-04-18 01:13:56.66508
334	2	事假	2026-05-02	2026-05-02	f	test	\N	1	pending	2026-04-18 01:13:59.050723	2026-04-18 01:13:59.050723
335	2	特休	2026-04-23	2026-04-24	t	半天 - Test	\N	1.5	pending	2026-04-18 01:16:32.302273	2026-04-18 01:16:32.302273
336	2	特休	2026-04-06	2026-04-07	t	半天 - 999	\N	1.5	pending	2026-04-18 01:18:08.9691	2026-04-18 01:18:08.9691
337	2	特休	2026-06-01	2026-06-01	f	E2E測試請假 - 請忽略	\N	1	pending	2026-04-18 01:55:55.653254	2026-04-18 01:55:55.653254
338	6	生理假	2026-04-20	2026-04-20	f	生理假	\N	1	pending	2026-04-19 23:13:11.892036	2026-04-19 23:13:11.892036
339	10	家庭照顧假	2026-04-20	2026-04-20	t	半天 - 家裡有事	\N	0.5	pending	2026-04-20 03:03:58.756426	2026-04-20 03:03:58.756426
340	5	家庭照顧假	2026-04-16	2026-04-16	f	太太生理期不舒服，在家照顧	\N	1	pending	2026-04-21 16:18:12.194285	2026-04-21 16:18:12.194285
341	6	家庭照顧假	2026-04-22	2026-04-22	t	半天 - 下午半日-維修冷氣	\N	0.5	pending	2026-04-27 02:15:20.515185	2026-04-27 02:15:20.515185
342	6	病假	2026-04-24	2026-04-24	f	腸胃炎	https://drive.google.com/uc?export=view&id=10cV4H0Y9cvWuJbacW8PU_9qv-cXNzyzD	1	pending	2026-04-27 02:20:41.489793	2026-04-27 02:20:41.489793
\.


--
-- Data for Name: user; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public."user" (id, username, password, is_admin, vacation_days, sick_days, personal_days, menstrual_days, family_care_days, compassionate_days) FROM stdin;
3	Alyssa	ssa	f	17	27	14	5	4	3
4	Clark	ark	f	9	30	14	0	6	3
7	Semine	meme	f	10	29	14	5	7	3
8	Yiling	1010	f	3	27	14	5	7	3
9	Leo	oole	f	10	28	14	0	7	3
1	Admin	admin123	t	10	5	0	0	0	0
2	David	david123	f	6	22.5	1.5	5	6.5	3
10	Connie	kk	f	8.5	29.5	14	3.5	1	3
5	Rooney	roy	f	6	29	14	0	5	3
6	Ice	icic	f	6	24	9.5	1.5	5	3
\.


--
-- Name: leave_record_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.leave_record_id_seq', 342, true);


--
-- Name: user_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.user_id_seq', 10, true);


--
-- Name: leave_record leave_record_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.leave_record
    ADD CONSTRAINT leave_record_pkey PRIMARY KEY (id);


--
-- Name: user user_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."user"
    ADD CONSTRAINT user_pkey PRIMARY KEY (id);


--
-- Name: user user_username_key; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public."user"
    ADD CONSTRAINT user_username_key UNIQUE (username);


--
-- Name: idx_leave_date_range; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_leave_date_range ON public.leave_record USING btree (start_date, end_date);


--
-- Name: idx_leave_user_date; Type: INDEX; Schema: public; Owner: postgres
--

CREATE INDEX idx_leave_user_date ON public.leave_record USING btree (user_id, start_date);


--
-- Name: leave_record leave_record_user_id_fkey; Type: FK CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.leave_record
    ADD CONSTRAINT leave_record_user_id_fkey FOREIGN KEY (user_id) REFERENCES public."user"(id) ON DELETE CASCADE;


--
-- PostgreSQL database dump complete
--

\unrestrict 6p6pU958sH6j8Whf1hV2MaxBUZ3361UqaHtMEPKRAbKE6sTz45I18E5UJYV1cAv

